{
    "Projects": "Progetti",
    "Home": "Home",
    "About": "Su di Me",
    "Greeting": "Ciao!",
    "Im": "Mi chiamo",
    "Typer1": "Machine Learning Engineer",
    "Typer2": "Open-source contributor",
    "Typer3": "Appassionato di Scienza ed ingegneria",
    "AboutHeader": "Su di",
    "Me": "Me",
    "MLE": "appassionato Machine Learning Engineer",
    "IWorkAt": "che lavora per",
    "Company": "Amadeus",
    "CompanyLocation": "a Nizza, Francia",
    "IHoldDegree1": "Ho una doppia laurea magistrale in",
    "School1": "conseguita al Politecnico di Torino",
    "And": "e",
    "School2": "ad EURECOM",
    "Interests": "I miei interessi professionali comprendono:",
    "Languages": "Linguaggi",
    "Frameworks": "Framework",
    "IUse": "che uso",
    "Tools": "Tools",
    "ProjHeader": "Alcuni",
    "Works": "Progetti",
    "View": "Vedi Progetto",
    "ProjSubtitle": "Alcuni progetti a cui ho lavorato recentemente",
    "Proj1": "Implementazione in Rust dell'API dei diffusers, equivalente alla versione in Python di huggingface. Basata sul crate tch-rs (Torch in Rust), quest'implementazione, di cui io sono il principale Open-source contributor, consente di utilizzare Stable Diffusion v1.5 e v2.1.",
    "Proj2": "Libreria di inferenza bayesiana per reti bayesiane discrete scritta in C++20. Supporta implementazioni in CPU e GPU (Cuda e OpenCL) dei principali algoritmi di inferenza e del copy-on-write (CoW) per ottimizzare l'occupazione di memoria dei grafi.",
    "Proj3": "Python toolkit di quantum machine learning, basato su Qiskit, questo progetto implementa alcuni algoritmi di machine e deep learning per un computer quantistico. Questo progetto è risultato vincitore di un premio come miglior progetto ad EURECOM.",
    "Proj4": "Portfolio personale per uso professionale. Scritto in React, NodeJS e ❤️. Facile da utilizzare ed adattare per le proprie esigenze.",
    "Proj5": "Pandas AI è un framework, scritto in Python, che integra Pandas con i modelli generativi, supportando tutto lo spettro dei Large Language Models (LLMs) più popolari e rendendo i dataframes conversazionali. Principale open source contributor.",
    "ThisWebsite": "Questo sito"
}
